config.el
(setq user-full-name "Daniel Xu"
      user-mail-address "hey@x0ba.lol")

;;fonts
